---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.Contains(Autodesk.Revit.DB.Definition)
source: html/c1e7d114-9bb7-9ed2-b919-a142b239b1d7.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Contains Method

## Syntax (C#)
```csharp
public virtual bool Contains(
	Definition key
)
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`)